Repository: LeDuyCoder/JapaneseApp
Catalog: lib/core/l10n/app_*.arb
Languages: vi

# tabbar_home
source: Home
vi: Trang Chủ

# tabber_distionary
source: Dictionary
vi: Từ Điển

# tabbar_character
source: Alphabet
vi: Bảng Chữ Cái

# tabbar_info
source: Info
vi: Thông Tin

# dashboard_folder
source: My Folders
vi: Thư Mục Của Tôi

# dashboard_folder_seemore
source: See All
vi: Xem Tất Cả

# dashboard_folder_content
source: topics
vi: chủ đề

# dashboard_folder_nodata_title
source: No folders yet
vi: Chưa có thư mục nào

# dashboard_folder_nodata_content
source: Create your first folder to organize your vocabulary
vi: Hãy tạo thư mục đầu tiên để sắp xếp từ vựng của bạn

# dashboard_comunication
source: Community
vi: Cộng Đồng

# dashboard_comunication_seemore
source: See All
vi: Xem Tất Cả

# topic_persent
source: Percentage
vi: Phần Trăm

# topic_word_finish
source: Completed
vi: Hoàn Thành

# topic_word_learning
source: Not Completed
vi: Chưa Hoàn Thành

# add_course
source: Course
vi: Học phần

# add_folder
source: Folder
vi: Thư Mục

# folderSeemore_title
source: My Folders
vi: Thư Mục Của Tôi

# folderSeemore_grid
source: Grid
vi: Lưới

# folderSeemore_tag_flex
source: List
vi: Danh Sách

# folderSeemore_content
source: All folders
vi: Tất cả thư mục

# folderSeemore_subContent
source: Folder
vi: Thư Mục

# folderManager_nodata_title
source: Start creating your own folder
vi: Bắt đầu tạo thư mục cho riêng bạn

# folderManager_nodata_button
source: Add learning topic
vi: Thêm chủ đề học

# folderManager_bottomSheet_addTopic
source: Add Learning Topic
vi: Thêm Chủ Đề Học

# folderManager_bottomSheet_removeFolder
source: Delete
vi: Xóa

# folderManager_topic_bottomSheet_remove
source: Remove from folder
vi: Xóa khỏi thư mục

# folderManager_Screen_addTopic_title
source: Add Course Topic
vi: Thêm Chủ Đề Học Phần

# folderManager_Screen_addTopic_card_owner
source: author: {name}
vi: tác giả: {name}

# folderManager_Screen_addTopic_card_amountWord
source: words: {amount}
vi: số từ: {amount}

# comunication_bottomSheet_notify_download_title
source: Do you want to download?
vi: Bạn có muốn tải xuống không

# comunication_bottomSheet_notify_download_btn
source: Download
vi: Tải

# download_Screen_downloading_title
source: Downloading Topic
vi: Đang Tải Chủ Đề

# download_Screen_downloading_contetnt
source: Please wait a moment...
vi: Vui lòng chờ trong giây lát...

# download_Screen_downloading_btn
source: Cancel
vi: Hủy

# download_Screen_Success_title
source: Download Successful
vi: Tải Thành Công

# download_Screen_Success_contetnt
source: The topic is ready to learn
vi: Chủ đề đã sẵn sàng để học

# download_Screen_Success_btn
source: Start learning
vi: Bắt đầu học

# dashboard_topic_nodata_title
source: No topics yet
vi: Chưa có chủ đề nào

# dashboard_topic_nodata_content
source: Create your first topic to start learning
vi: Hãy tạo chủ đề đầu tiên để bắt đầu học

# communication_Screen_title
source: Community
vi: Cộng Đồng

# communication_Screen_hint_search
source: Enter topic name...
vi: Nhập tên chủ đề...

# communication_Screen_subTitle
source: Community Collection
vi: Bộ Sư Tập Cộng Đồng

# dashboard_topic
source: My Topics
vi: Chủ để của tôi

# dashboard_topic_seemore
source: See All
vi: Xem Tất Cả

# topic_seemore_title
source: My Topics
vi: Chủ Đề Của Tôi

# topic_seemore_subTitle
source: Topics
vi: Chủ Đề

# bottomSheet_add_topic
source: Course
vi: Học Phần

# bottomSheet_add_folder
source: Folder
vi: Thư Mục

# popup_add_topic
source: Add New Topic
vi: Thêm Chủ Đề Mới

# popup_add_topic_hint
source: Topic Name
vi: Tên Chủ Đề

# popup_add_topic_exit
source: Topic Name Already Exists
vi: Tên Chủ Đề Đã Tồn Tại

# popup_add_topic_btn_create
source: Create
vi: Tạo

# popup_add_topic_btn_cancle
source: Cancel
vi: Hủy

# addWord_Screen_Input_Japan_Label
source: Japanese Vocabulary
vi: Từ vựng tiếng nhật

# addWord_Screen_Input_Japan_Hint
source: Japanese word
vi: Từ tiếng nhật

# addWord_Screen_Input_WayRead_Label
source: Reading (Hiragana)
vi: Cách đọc (Hiragana)

# addWord_Screen_Input_WayRead_Hint
source: reading
vi: cách đọc

# addWord_Screen_Input_Mean_Label
source: Word Meaning
vi: Nghĩa của từ

# addWord_Screen_Input_Mean_Hint
source: meaning
vi: nghĩa

# addWord_Screen_btn_add
source: Add Word
vi: Thêm Từ

# addWord_bottomShet_warning_save_title
source: Warning
vi: Cảnh Báo

# addWord_bottomShet_warning_save_content
source: Once saved, it cannot be edited
vi: Khi lưu không thể chỉnh sữa

# addWord_bottomShet_warning_save_btn
source: Save
vi: Lưu

# addWord_bottomShet_success_save_title
source: Saved Successfully
vi: Lưu Thành Công

# addWord_bottomShet_success_save_content
source: The topic you created has been successfully saved ðŸŽ‰
vi: Chủ đề bạn tạo đã được tạo thành công 🎉

# listword_Screen_title
source: Topic
vi: Chủ Đề

# listword_Screen_AmountWord
source: vocabulary
vi: từ vựng

# listword_Screen_Learned
source: learned
vi: đã thuộc

# listword_Screen_head_col1
source: Japanese
vi: Tiếng Nhật

# listword_Screen_head_col2
source: Meaning
vi: Nghĩa

# listword_Screen_head_col3
source: Status
vi: Trạng Thái

# listword_Screen_bottomSheet_public_title
source: Do you want to share?
vi: Bạn có muốn chia sẻ không?

# listword_Screen_bottomSheet_public_content
source: When shared, anyone can download
vi: Khi chia sẻ, ai cũng có thể tải về

# listword_Screen_bottomSheet_public_btn_pulic
source: Public
vi: Công Khai

# listword_Screen_bottomSheet_public_btn_cancel
source: Cancel
vi: Hủy

# listword_Screen_bottomSheet_public_succes_title
source: Congratulations
vi: Chúc Mừng

# listword_Screen_bottomSheet_public_succes_content
source: You have successfully shared your topic
vi: Bạn đã chia sẽ thành công bộ chủ đề của bạn

# listword_Screen_bottomSheet_private_title
source: Do you want to cancel sharing?
vi: Bạn có muốn hủy chia sẻ không

# listword_Screen_bottomSheet_private_btn_private
source: Unshare
vi: Hủy chia sẻ

# listword_Screen_bottomSheet_private_btn_cancel
source: No
vi: Không

# listword_Screen_bottomSheet_private_success_title
source: Unshared Successfully
vi: Hủy Công Khai Thành Công

# listword_Screen_bottomSheet_private_success_content
source: You have unshared your topic
vi: Bạn đã hủy chia sẽ chủ đề của bạn

# listword_Screen_btn_learn
source: Learn Now
vi: Học Ngay

# keyboard_handwriting_btn_space
source: Space
vi: Khoảng trắng

# keyboard_handwriting_btn_remove
source: Delete
vi: Xóa

# distionary_Screen_title
source: Japanese Dictionary
vi: Từ Điển Tiếng Nhật

# distionary_Screen_hint
source: Enter word to search
vi: Nhập Từ Muốn Tra

# distionary_Screen_hint_title
source: Search Vocabulary
vi: Tra Từ Vựng

# distionary_Screen_hint_content
source: Start searching and learning your words
vi: Bắt đầu tra và học từ của bạn nào

# distionary_Screen_mean
source: Word Meaning
vi: Nghĩa của từ

# distionary_Screen_info
source: Word Info
vi: Thông tin từ

# distionary_Screen_type
source: Noun:
vi: Danh từ:

# distionary_Screen_level
source: Level:
vi: Cấp Độ:

# popup_remove_topic_title
source: Delete Topic
vi: Xóa chủ đề

# popup_remove_topic_content
source: Do you want to delete?
vi: Bạn có muốn xóa không

# popup_remove_topic_btn_cancle
source: Cancel
vi: Hủy

# popup_remove_topic_btn_delete
source: Delete
vi: Xóa

# character_btn_learn
source: Learn Alphabet
vi: Học Chữ Cái

# listWord_word_complete
source: Completed {count}
vi: Hoàn Thành {count}

# listWord_word_learning
source: Not Completed {count}
vi: Chưa Hoàn Thành {count}

# listWord_btn_learn
source: Learn Words
vi: Học Từ

# listWord_share_title
source: Topic name {topic}
vi: Tên chủ đền {topic}

# listWord_share_amount_word
source: Total: {amount} words
vi: số lượng: {amount} Từ

# listWord_share_type
source: Type: {type}
vi: Loại: {type}

# listWord_btn_remove
source: Delete
vi: Xóa

# listWord_btn_shared
source: Share
vi: Chia Sẻ

# learn_warningGboard
source: It is recommended to use Gboard for the best experience
vi: Khuyến nghị sử dụng Gboard để có trả nghiệm tốt nhất

# learn_btn_check
source: Check
vi: Kiểm tra

# learn_bottomsheet_wrong_title
source: Incorrect
vi: Không Chính Xác

# learn_bottomsheet_wrong_content
source: The correct answer is
vi: Câu trả lời đúng là

# learn_bottomsheet_wrong_btn
source: Continue
vi: Tiếp Tục

# learn_write_input
source: Write
vi: Viết

# learn_bottomsheet_right_title
source: Correct Answer
vi: Trả Lời Chính Xác

# motivationalPhrases_1
source: Keep going, you're doing great!
vi: Tiếp tục cố gắng, bạn đang làm rất tốt!

# motivationalPhrases_2
source: Perfect this time, keep it up!
vi: Lần này bạn đã hoàn hảo, hãy tiếp tục cố gắng!

# motivationalPhrases_3
source: Every step forward is progress!
vi: Mỗi bước tiến lên đều là một sự tiến bộ!

# motivationalPhrases_4
source: Believe in yourself and keep trying!
vi: Hãy tin vào bản thân và tiếp tục nỗ lực!

# motivationalPhrases_5
source: You can do it, never give up!
vi: Bạn có thể làm được, đừng bao giờ bỏ cuộc!

# motivationalPhrases_6
source: Success comes to those who keep striving!
vi: Thành công đến với những ai không ngừng cố gắng!

# motivationalPhrases_7
source: Keep improving, step by step!
vi: Tiếp tục cải thiện, từng bước một!

# motivationalPhrases_8
source: Be strong, stay focused, and keep moving forward!
vi: Hãy mạnh mẽ, tập trung và tiếp tục tiến lên!

# motivationalPhrases_9
source: Great effort! Keep aiming higher!
vi: Nỗ lực tuyệt vời! Hãy tiếp tục đặt mục tiêu cao hơn!

# motivationalPhrases_10
source: Your hard work will soon pay off!
vi: Sự chăm chỉ của bạn sẽ sớm được đền đáp!

# learn_bottomsheet_right_btn
source: Continue
vi: Tiếp Tục

# learning_combine_title
source: Match from column A to column B
vi: Nói từ cột A sang cột B

# learn_translate_title
source: Translate the sentence below
vi: Dịch Câu Bên Dưới

# learn_listen_title
source: What do you hear?
vi: Bạn Nghe Được Gì

# learn_chose_title
source: Which word is correct?
vi: Từ nào đúng của từ

# congraculate_title
source: Completed
vi: Hoàn Thành

# congraculate_content
source: You are amazing
vi: Bạn Thật Tuyệt vời

# congraculate_commited
source: Time
vi: Thời Gian

# congraculate_amzing
source: Awesome
vi: Tuyệt vời

# profile_level
source: Level
vi: Cấp Bậc

# profile_topic
source: Topic
vi: Chủ Đề

# profile_title
source: Title
vi: Danh Hiệu

# levelTitles_1
source: Learner
vi: Học Sĩ

# levelTitles_2
source: Wise Scholar
vi: Minh Triết Giả

# levelTitles_3
source: Thinker
vi: Tư Tưởng Gia

# levelTitles_4
source: Erudite Sage
vi: Bác Học Tôn Giả

# levelTitles_5
source: Academician
vi: Hàn Lâm Học Sĩ

# levelTitles_6
source: Literary Genius
vi: Kỳ Tài Văn Học

# levelTitles_7
source: Wise Saint
vi: Trí Thánh Nhân

# levelTitles_8
source: Debating Genius
vi: Thiên Tài Biện Luận

# levelTitles_9
source: Master Scholar
vi: Học Đạo Tinh Thông

# levelTitles_10
source: Virtuous Scholar
vi: Chí Sĩ Văn Nhân

# levelTitles_11
source: Diligent Student
vi: Luyện Tư Học Sĩ

# levelTitles_12
source: Enlightened One
vi: Thông Tuệ Giả

# levelTitles_13
source: Profound Philosopher
vi: Hiền Triết Uyên Thâm

# levelTitles_14
source: Elegant Sage
vi: Văn Nhã Chân Nhân

# levelTitles_15
source: Talented Scholar
vi: Trí Nhân Kỳ Tài

# profile_date
source: Month {month} Year {year}
vi: Tháng {month} Năm {year}

# setting_title
source: Settings
vi: Cài Đặt

# setting_achivement_title
source: Achievements
vi: Thành Tựu

# setting_achivement_content
source: List of earned achievements
vi: Danh sách thành tựu đã đặt được

# setting_language_title
source: Language
vi: Ngôn Ngữ

# setting_language_content
source: Select display language
vi: Chọn ngôn ngữ hiển thị

# setting_async_title
source: Sync Data
vi: Đồng Bộ Dữ Liệu

# setting_async_content
source: Sync data to the cloud
vi: Đồng bộ dữ liệu lên đám mây

# setting_downloadAsync_title
source: Download Data
vi: Tải Bộ Dữ Liệu

# setting_downloadAsync_content
source: Download synced data from your old device
vi: Tải bộ dữ liệu đã đồng bộ trên máy củ của bạn

# setting_signout_title
source: Sign Out
vi: Đăng Xuất

# setting_signout_content
source: Sign out of your current account
vi: Đăng xuất khỏi tài khoản hiện tại

# achivement_title_one
source: Achievement
vi: Thành Tựu

# achivement_owl_title
source: Night Owl
vi: Cú Đêm Học Khuya

# achivement_owl_description
source: Study between 12am and 2am
vi: Học từ lúc 0h đến 2 giờ sáng

# achivement_tryhard_title
source: Hardworking Knowledge Seeker
vi: Tri Thức Chăm Chỉ

# achivement_tryhard_description
source: Study between 4am and 6am
vi: Học từ lúc 4 đến 6 giờ sáng

# achivement_habit_title
source: Habit Builder
vi: HÌnh Thành Thói Quen

# achivement_habit_description
source: Study for 28 consecutive days
vi: Học liên tiếp 28 ngày

# achivement_title_two
source: Study Streak
vi: Chuổi Ngày Học

# achivement_streak_title
source: {day}-Day Streak
vi: Chuổi {day} ngày

# achivement_streak_description
source: Earned after studying {day} consecutive days
vi: Nhận khi học liên tục {day} ngày

# achivement_title_three
source: Completed Topics
vi: Chủ Đề Hoàn Thành

# achivement_topic_title
source: {amount} Topics
vi: {amount} Chủ Đề

# achivement_topic_description
source: Earned after completing {amount} topics
vi: Nhận khi hoàn thành {amount} chủ đề

# bottomSheetAsync_Success_Description
source: Data has been successfully synced
vi: Dữ liệu đã được đồng bộ hóa thành công

# bottomSheet_Nointernet_title
source: No Internet Connection
vi: Không Có Kết Nối Internet

# bottomSheet_Nointernet_Description
source: Please check your internet connection and try again
vi: Vui lòng kểm tra kết nối internet của bạn và thử lại

# bottomSheet_Error_title
source: Data Load Error
vi: Lỗi Tải Dữ Liệu

# bottomSheet_Error_description
source: No synced data available
vi: Hiện không có bản đồng bộ hóa dữ liệu nào

# bottomSheet_Warning_title
source: Warning
vi: Cảnh Báo

# bottomSheet_Warning_Description
source: When syncing, all data on this device will be deleted
vi: Khi đồng bộ toa bộ dữ liệu trên máy hiện tại sẽ bị xóa

# bottomSheet_Warning_btn_cancle
source: Cancel
vi: Hủy

# language_title
source: Language
vi: Ngôn ngữ

# language_bottomsheet_success
source: Language Updated Successfully
vi: Cập Nhật Ngôn Ngữ Thành Công

# error_connect_server
source: Server Connection Error
vi: Lỗi Kết Nối Đến Máy Chủ

# login_title
source: Welcome back, glad to see you
vi: Chào mừng trở lại, Rất vui được gặp bạn

# login_email_input_hint_focus
source: Enter your email
vi: Nhập email của bạn

# login_email_input_password
source: Password
vi: Mật Khẩu

# login_email_input_password_hint
source: Enter Password
vi: Nhập Mật Khẩu

# login_btn
source: Login
vi: Đăng Nhập

# login_create_question_account
source: Don't have an account?
vi: Không Có Tài Khoảng

# login_create_btn_account
source: Sign Up
vi: Đăng Kí

source: Login with Facebook
vi: Đăng Nhập Với Facebook

source: Login with Google
vi: Đăng Nhập Với Google

# login_invalid_email
source: Invalid Email
vi: Email Không Hợp Lệ

# login_user_disabled
source: Account Disabled
vi: Tài Khoản Đã Bị Khóa

# login_user_not_found
source: No account found with this email
vi: Không tìm thấy tài khoản với email này

# login_wrong_password
source: Incorrect password
vi: Mật khẩu không đúng

# login_error
source: An error occurred
vi: Đã Có Lỗi Xảy Ra

# register_title
source: Hello, Sign up to start your journey
vi: Xin chào, Đăng kí để bắt đầu trải nghiệm

# register_email_input_hint_focus
source: Enter your email
vi: Nhập email của bạn

# register_user_input_hint
source: Username
vi: Tên Người Dùng

# register_user_input_hint_focus
source: Enter username
vi: Nhập tên người dùng

# register_password_input_hint
source: Password
vi: Mật Khẩu

# register_password_input_hint_focus
source: Enter Password
vi: Nhập Mật Khẩu

# register_re_password_input_hint
source: Confirm Password
vi: Nhập Lại Mật Khẩu

# register_re_password_input_hint_focus
source: Re-enter Password
vi: Nhập Lại Mật Khẩu

# register_btn
source: Sign Up
vi: Đăng Kí

# register_question_login
source: Already have an account?
vi: Đã Có Tài Khoảng

# register_btn_login
source: Login
vi: Đăng Nhập

# register_email_already_in_use
source: This email is already registered
vi: Email này đã được đăng ký

# register_invalid_email
source: Invalid email address
vi: Địa chỉ email không hợp lệ.

# register_operation_not_allowed
source: Email/password account not enabled
vi: Tài khoản email/mật khẩu chưa được kích hoạt.

# register_weak_password
source: Weak Password
vi: Mật Khẩu Quá Yếu

# register_error
source: An error occurred
vi: Đã Có Lỗi Xảy Ra

# register_success
source: Account created successfully, please go back to login
vi: Tạo tài khoản thành công, quay lại trang đăng nhập
