Repository: LeDuyCoder/JapaneseApp
Catalog: lib/l10n/app_*.arb
Languages: ja, ru, zh

# tabbar_home
source: Home
ja: ホーム
ru: Главная
zh: 首页

# tabbar_character
source: Alphabet
ja: アルファベット
ru: Алфавит
zh: 字母

# tabbar_info
source: Info
ja: 情報
ru: Информация
zh: 信息

# dashboard_hintSearch
source: Word you want to search
ja: 検索したい単語
ru: Слово, которое вы хотите найти
zh: 想要搜索的单词

# dashboard_folder
source: Folder
ja: フォルダー
ru: Папка
zh: 文件夹

# dashboard_course
source: Course
ja: コース
ru: Курс
zh: 课程

# dashboard_topic
source: Topic
ja: トピック
ru: тема
zh: 主题

# dashboard_popupDownload_title
source: Do you want to download?
ja: ダウンロードしますか？
ru: Хотите скачать?
zh: 要下载吗？

# dashboard_popupDownload_btn_cancel
source: Cancel
ja: キャンセル
ru: Отмена
zh: 取消

# dashboard_popupDownload_btn_dowload
source: Download
ja: ダウンロード
ru: Скачать
zh: 下载

# dashboard_seemore
source: See More
ja: もっと見る
ru: Показать больше
zh: 查看更多

# dashboard_btn_import
source: Import
ja: インポート
ru: Импорт
zh: 导入

# tutorial_one_title
source: Install the App
ja: アプリをインストール
ru: Установите приложение
zh: 安装应用

# tutorial_one_content
source: Make sure your device has the Gboard app installed
ja: 端末にGboardアプリがインストールされていることを確認してください
ru: Убедитесь, что приложение Gboard установлено на вашем устройстве
zh: 请确认设备中已安装Gboard应用

# tutorial_two_title
source: Open Settings
ja: 設定を開く
ru: Откройте Настройки
zh: 打开设置

# tutorial_two_content
source: Go to the settings app to set up the Japanese handwriting keyboard
ja: 設定アプリを開き、日本語手書きキーボードを設定します
ru: Откройте приложение Настройки и настройте японскую рукописную клавиатуру
zh: 打开设置应用，配置日语手写键盘

# tutorial_three_title
source: Search for Gboard
ja: Gboardを検索
ru: Найдите Gboard
zh: 搜索Gboard

# tutorial_three_content
source: Tap to search and find Gboard as shown in the image
ja: 検索してGboardを見つけ、画像の通りにタップしてください
ru: Найдите Gboard и нажмите, как показано на изображении
zh: 搜索并找到Gboard，按照图片操作点击

# tutorial_four_content
source: Continue tapping as instructed
ja: 指示通りにタップを続けてください
ru: Продолжайте нажимать согласно инструкции
zh: 按照指示继续点击

# tutorial_five_title
source: Languages
ja: 言語
ru: Языки
zh: 语言

# tutorial_five_content
source: Tap on the language section
ja: 言語セクションをタップしてください
ru: Нажмите на раздел языков
zh: 点击语言部分

# tutorial_six_title
source: Add Keyboard
ja: キーボードを追加
ru: Добавить клавиатуру
zh: 添加键盘

# tutorial_six_content
source: Tap to add a keyboard and choose Japanese
ja: キーボードを追加して日本語を選択してください
ru: Добавьте клавиатуру и выберите японский
zh: 添加键盘并选择日语

# tutorial_seven_title
source: Search Japanese
ja: 日本語を検索
ru: Поиск японского
zh: 搜索日语

# tutorial_seven_content
source: Search for the Japanese language
ja: 日本語を検索してください
ru: Поиск японского языка
zh: 搜索日语

# tutorial_eight_title
source: Handwriting
ja: 手書き入力
ru: Рукописный ввод
zh: 手写输入

# tutorial_eight_content
source: Choose the handwriting keyboard and tap Done
ja: 手書きキーボードを選択し、「完了」をタップしてください
ru: Выберите рукописную клавиатуру и нажмите Готово
zh: 选择手写键盘，点击“完成”

# tutorial_nice_title
source: Switch Keyboard
ja: キーボードを切り替え
ru: Смена клавиатуры
zh: 切换键盘

# tutorial_nice_content
source: Remember to switch keyboards when practicing writing to improve memory
ja: 練習の際はキーボードを切り替えて記憶を強化しましょう
ru: При обучении письму переключайтесь на клавиатуру, чтобы лучше запоминать
zh: 练习时切换键盘以增强记忆

# tutorial_btn_back
source: Back
ja: 戻る
ru: Назад
zh: 返回

# tutorial_btn_forward
source: Next
ja: 次へ
ru: Вперед
zh: 下一步

# tutorial_btn_skip
source: Skip
ja: スキップ
ru: Пропустить
zh: 跳过

# tutorial_one_done
source: Done
ja: 完了
ru: Готово
zh: 完成

# course_owner
source: Created by {user_nane}
ja: {user_nane} によって作成
ru: создано {user_nane}
zh: 由 {user_nane} 创建

# amount_word
source: Amount: {amount} Words
ja: 単語数: {amount} 語
ru: Количество: {amount} слов
zh: 单词数: {amount} 个

# word_finish
source: Completed: {amount}
ja: 完了: {amount}
ru: Завершено: {amount}
zh: 完成: {amount}

# word_learning
source: Incomplete: {amount}
ja: 未完了: {amount}
ru: Не завершено: {amount}
zh: 未完成: {amount}

# add_course
source: Course
ja: コース
ru: Курс
zh: 课程

# add_folder
source: Folder
ja: フォルダー
ru: Папка
zh: 文件夹

# folderManager
source: Add Course Topic
ja: コーストピックを追加
ru: Добавить тему курса
zh: 添加课程主题

# folderManager_addTopic
source: Add Topic
ja: トピックを追加
ru: Добавить тему
zh: 添加主题

# folderManager_remove
source: Delete
ja: 削除
ru: Удалить
zh: 删除

# folderManager_removeTopic
source: Remove from Folder
ja: フォルダーから削除
ru: Удалить из папки
zh: 从文件夹删除

# seemore_search
source: Folder Name
ja: フォルダー名
ru: Название папки
zh: 文件夹名称

# import_title
source: Choose Import Method
ja: インポート方法を選択
ru: Выберите способ импорта
zh: 选择导入方式

# import_btn_file
source: From File
ja: ファイルから
ru: Из файла
zh: 从文件导入

# import_btn_qr
source: From QR
ja: QRから
ru: С помощью QR
zh: 通过QR导入

# character_btn_learn
source: Learn Characters
ja: 文字を学ぶ
ru: Изучать буквы
zh: 学习字符

# listWord_word_complete
source: Completed {count}
ja: 完了 {count}
ru: Завершено {count}
zh: 完成 {count}

# listWord_word_learning
source: Incomplete {count}
ja: 未完了 {count}
ru: Не завершено {count}
zh: 未完成 {count}

# listWord_btn_learn
source: Learn Words
ja: 単語を学ぶ
ru: Изучать слова
zh: 学习单词

# listWord_share_title
source: Topic Name: {topic}
ja: トピック名: {topic}
ru: Название темы: {topic}
zh: 主题名: {topic}

# listWord_share_amount_word
source: Amount: {amount} Words
ja: 単語数: {amount} 語
ru: Количество: {amount} слов
zh: 单词数: {amount} 个

# listWord_share_type
source: Type: {type}
ja: 種類: {type}
ru: Тип: {type}
zh: 类型: {type}

# listWord_btn_remove
source: Delete
ja: 削除
ru: Удалить
zh: 删除

# listWord_btn_shared
source: Share
ja: 共有
ru: Поделиться
zh: 分享

# learn_warningGboard
source: Gboard is recommended for the best experience
ja: 最適な体験のためにGboardを推奨します
ru: Рекомендуется использовать Gboard для наилучшего опыта
zh: 为获得最佳体验，推荐使用Gboard

# learn_btn_check
source: Check
ja: 確認
ru: Проверить
zh: 确认

# learn_bottomsheet_wrong_title
source: Incorrect
ja: 不正解
ru: Неверно
zh: 错误

# learn_bottomsheet_wrong_content
source: The correct answer is
ja: 正しい答えは
ru: Правильный ответ:
zh: 正确答案是

# learn_bottomsheet_wrong_btn
source: Continue
ja: 続ける
ru: Продолжить
zh: 继续

# learn_write_input
source: Write
ja: 書く
ru: Писать
zh: 书写

# learn_bottomsheet_right_title
source: Correct Answer
ja: 正解
ru: Правильно
zh: 正确

# motivationalPhrases_1
source: Keep going, you're doing great!
ja: その調子！よくできています！
ru: Продолжайте в том же духе, вы отлично справляетесь!
zh: 干得好！继续保持！

# motivationalPhrases_2
source: You did great this time, keep pushing forward!
ja: 今回もよくできました、次も頑張ろう！
ru: На этот раз вы справились идеально, продолжайте!
zh: 这次也很棒，下次继续加油！

# motivationalPhrases_3
source: Every step forward is progress!
ja: 一歩前進するごとに成長です！
ru: Каждый шаг — это прогресс!
zh: 每一步进步都是成长！

# motivationalPhrases_4
source: Believe in yourself and keep trying!
ja: 自分を信じて挑戦し続けてください！
ru: Верьте в себя и продолжайте стараться!
zh: 相信自己，不断挑战！

# motivationalPhrases_5
source: You can do it, never give up!
ja: 諦めなければ必ずできます！
ru: Вы сможете это сделать, никогда не сдавайтесь!
zh: 只要不放弃，就一定能成功！

# motivationalPhrases_6
source: Success comes to those who don’t quit!
ja: 成功は諦めない人に訪れます！
ru: Успех приходит к тем, кто не перестает пытаться!
zh: 成功属于坚持不懈的人！

# motivationalPhrases_7
source: Keep improving step by step!
ja: 一歩ずつ着実に成長しましょう！
ru: Продвигайтесь вперед шаг за шагом!
zh: 一步一步稳步成长！

# motivationalPhrases_8
source: Be strong, stay focused, and keep going!
ja: 強く、集中して、続けましょう！
ru: Будьте сильными, сосредоточенными и двигайтесь вперед!
zh: 保持专注，继续努力！

# motivationalPhrases_9
source: Amazing effort! Aim even higher!
ja: 素晴らしい努力です！さらに上を目指しましょう！
ru: Отличные усилия! Стремитесь к большему!
zh: 了不起的努力！继续向上！

# motivationalPhrases_10
source: Your hard work will pay off soon!
ja: 努力は必ず報われます！
ru: Ваш труд обязательно окупится!
zh: 努力必有回报！

# learn_bottomsheet_right_btn
source: Continue
ja: 続ける
ru: Продолжить
zh: 继续

# learning_combine_title
source: Match from Column A to Column B
ja: A列とB列をマッチさせましょう
ru: Сопоставьте слова из столбца А со столбцом B
zh: 将A列与B列匹配

# learn_translate_title
source: Translate the Sentence Below
ja: 次の文を翻訳してください
ru: Переведите предложение ниже
zh: 请翻译以下句子

# learn_listen_title
source: What Did You Hear?
ja: 何と聞こえましたか？
ru: Что вы услышали?
zh: 你听到了什么？

# learn_chose_title
source: Which word is correct?
ja: 正しい単語はどれですか？
ru: Какое слово правильное?
zh: 哪个单词是正确的？

# congraculate_title
source: Completed
ja: 完了
ru: Завершено
zh: 完成

# congraculate_content
source: You’re Amazing!
ja: 素晴らしい！
ru: Вы великолепны
zh: 太棒了！

# congraculate_commited
source: Time Spent
ja: 学習時間
ru: Время
zh: 学习时间

# congraculate_amzing
source: Wonderful
ja: すごい
ru: Отлично
zh: 了不起

# profile_level
source: Level
ja: レベル
ru: Уровень
zh: 等级

# profile_topic
source: Topic
ja: トピック
ru: Тема
zh: 主题

# profile_title
source: Title
ja: 称号
ru: Звание
zh: 称号

# levelTitles_1
source: Scholar
ja: 学者
ru: Ученый
zh: 学者

# levelTitles_2
source: Wise One
ja: 賢者
ru: Мудрец
zh: 贤者

# levelTitles_3
source: Thinker
ja: 思想家
ru: Мыслитель
zh: 思想家

# levelTitles_4
source: Honorable Academic
ja: 名誉ある学者
ru: Почетный ученый
zh: 荣誉学者

# levelTitles_5
source: Academic Scholar
ja: 学術学者
ru: Академический ученый
zh: 学术学者

# levelTitles_6
source: Literary Genius
ja: 文才の天才
ru: Гений литературы
zh: 文才天才

# levelTitles_7
source: Sage
ja: 聖人
ru: Святой
zh: 圣人

# levelTitles_8
source: Debating Genius
ja: 討論の天才
ru: Гений дебатов
zh: 辩论天才

# levelTitles_9
source: Master Learner
ja: 学習の達人
ru: Мастер обучения
zh: 学习达人

# levelTitles_10
source: Literary Gentleman
ja: 文学紳士
ru: Литературный джентльмен
zh: 文学绅士

# levelTitles_11
source: Disciplined Scholar
ja: 規律ある学者
ru: Дисциплинированный ученый
zh: 有纪律的学者

# levelTitles_12
source: Enlightened One
ja: 悟りを開いた者
ru: Просветленный
zh: 开悟者

# levelTitles_13
source: Profound Sage
ja: 深遠な賢者
ru: Глубокий мудрец
zh: 深邃贤者

# levelTitles_14
source: Elegant Master
ja: 優雅な師
ru: Элегантный наставник
zh: 优雅导师

# levelTitles_15
source: Gifted Intellectual
ja: 知性の天才
ru: Гений интеллекта
zh: 智慧天才

# profile_date
source: Month {month}, Year {year}
ja: {year}年{month}月
ru: {month} месяц {year} год
zh: {year}年{month}月

# setting_title
source: Settings
ja: 設定
ru: Настройки
zh: 设置

# setting_achivement_title
source: Achievements
ja: 実績
ru: Достижения
zh: 成就

# setting_achivement_content
source: List of achievements unlocked
ja: 解除した実績の一覧
ru: Список полученных достижений
zh: 已解锁成就列表

# setting_language_title
source: Language
ja: 言語
ru: Язык
zh: 语言

# setting_language_content
source: Select display language
ja: 表示言語を選択
ru: Выберите язык интерфейса
zh: 选择显示语言

# setting_async_title
source: Data Sync
ja: データ同期
ru: Синхронизация данных
zh: 数据同步

# setting_async_content
source: Sync data to the cloud
ja: データをクラウドに同期
ru: Синхронизация данных с облаком
zh: 将数据同步到云端

# setting_downloadAsync_title
source: Download Data
ja: データをダウンロード
ru: Загрузить данные
zh: 下载数据

# setting_downloadAsync_content
source: Download synced data from your previous device
ja: 以前の端末から同期済みデータをダウンロード
ru: Загрузите данные, синхронизированные с предыдущего устройства
zh: 从以前设备下载已同步的数据

# setting_signout_title
source: Sign Out
ja: ログアウト
ru: Выйти
zh: 退出登录

# setting_signout_content
source: Sign out from the current account
ja: 現在のアカウントからサインアウト
ru: Выйти из текущей учетной записи
zh: 从当前账户登出

# achivement_title_one
source: Achievements
ja: 実績
ru: Достижения
zh: 成就

# achivement_owl_title
source: Night Owl
ja: 夜更かしフクロウ
ru: Ночной совенок
zh: 夜猫子

# achivement_owl_description
source: Studied between 12am and 2am
ja: 午前0時から2時の間に学習した
ru: Учился с 0 до 2 часов ночи
zh: 在凌晨0点到2点间学习

# achivement_tryhard_title
source: Early Bird Learner
ja: 早起き学習者
ru: Усердный ученик
zh: 早起学习者

# achivement_tryhard_description
source: Studied between 4am and 6am
ja: 午前4時から6時の間に学習した
ru: Учился с 4 до 6 утра
zh: 在凌晨4点到6点间学习

# achivement_habit_title
source: Habit Builder
ja: 習慣の構築者
ru: Создание привычки
zh: 习惯养成者

# achivement_habit_description
source: Studied for 28 consecutive days
ja: 28日間連続で学習した
ru: Учился 28 дней подряд
zh: 连续28天学习

# achivement_title_two
source: Study Streak
ja: 学習連続日数
ru: Серия дней обучения
zh: 连续学习天数

# achivement_streak_title
source: {day}_Day Streak
ja: {day}日連続
ru: Серия {day} дней
zh: 连续 {day} 天

# achivement_streak_description
source: Earned by studying {day} days in a row
ja: {day}日連続で学習した
ru: Достижение за {day} дней подряд
zh: 连续学习 {day} 天

# achivement_title_three
source: Completed Topics
ja: トピック完了
ru: Завершенные темы
zh: 主题完成

# achivement_topic_title
source: {amount} Topics
ja: {amount} トピック
ru: {amount} тем
zh: {amount} 个主题

# achivement_topic_description
source: Earned after completing {amount} topics
ja: {amount} トピックを完了した
ru: Достижение за завершение {amount} тем
zh: 完成 {amount} 个主题

# bottomSheetAsync_Success_Description
source: Data synced successfully
ja: データが正常に同期されました
ru: Данные успешно синхронизированы
zh: 数据已成功同步

# bottomSheetAsync_Success_Btn
source: OK
zh: 确定

# bottomSheet_Nointernet_title
source: No Internet Connection
ja: インターネット接続なし
ru: Нет подключения к интернету
zh: 无网络连接

# bottomSheet_Nointernet_Description
source: Please check your internet connection and try again
ja: インターネット接続を確認して、もう一度お試しください
ru: Проверьте подключение к интернету и повторите попытку
zh: 请检查网络连接后重试

# bottomSheet_Nointernet_Btn
source: OK
zh: 确定

# bottomSheet_Warning_title
source: Warning
ja: 警告
ru: Предупреждение
zh: 警告

# bottomSheet_Warning_Description
source: Syncing will erase all local data on this device
ja: 同期すると、この端末のローカルデータはすべて削除されます
ru: При синхронизации все локальные данные на этом устройстве будут удалены
zh: 同步后，设备上的本地数据将全部删除

# bottomSheet_Warning_btn_ok
source: OK
zh: 确定

# bottomSheet_Warning_btn_cancle
source: Cancel
ja: キャンセル
ru: Отмена
zh: 取消

# bottomSheet_Error_title
source: Data Download Error
ja: データダウンロードエラー
ru: Ошибка загрузки данных
zh: 数据下载错误

# bottomSheet_Error_description
source: There is currently no data sync available
ja: 現在利用可能な同期データはありません
ru: В настоящее время нет доступных синхронизированных данных
zh: 当前没有可用的同步数据

# language_title
source: Language
ja: 言語
ru: Язык
zh: 语言

# language_bottomsheet_success
source: Language updated successfully
ja: 言語が正常に更新されました
ru: Язык успешно обновлен
zh: 语言已成功更新

# error_connect_server
source: Failed to connect to the server
ja: サーバーに接続できませんでした
ru: Ошибка подключения к серверу
zh: 无法连接服务器

# login_title
source: Welcome back, happy to see you
ja: お帰りなさい、お会いできて嬉しいです
ru: С возвращением! Рады вас видеть
zh: 欢迎回来，很高兴见到你

# login_email_input_hint
source: Email
ja: メールアドレス
ru: Электронная почта
zh: 邮箱地址

# login_email_input_hint_focus
source: Enter your email
ja: メールアドレスを入力してください
ru: Введите вашу электронную почту
zh: 请输入邮箱地址

# login_email_input_password
source: Password
ja: パスワード
ru: Пароль
zh: 密码

# login_email_input_password_hint
source: Enter your password
ja: パスワードを入力してください
ru: Введите пароль
zh: 请输入密码

# login_btn
source: Login
ja: ログイン
ru: Войти
zh: 登录

# login_create_question_account
source: Don't have an account?
ja: アカウントをお持ちでないですか？
ru: Нет учетной записи?
zh: 没有账户吗？

# login_create_btn_account
source: Sign Up
ja: 新規登録
ru: Регистрация
zh: 注册

source: Login with Facebook
ja: Facebookでログイン
ru: Войти через Facebook
zh: 使用Facebook登录

source: Login with Google
ja: Googleでログイン
ru: Войти через Google
zh: 使用Google登录

# login_invalid_email
source: Invalid email address
ja: 無効なメールアドレスです
ru: Неверный адрес электронной почты
zh: 无效邮箱地址

# login_user_disabled
source: This account has been disabled
ja: このアカウントは無効になっています
ru: Эта учетная запись отключена
zh: 该账户已被禁用

# login_user_not_found
source: No account found with this email
ja: このメールのアカウントは見つかりませんでした
ru: Учетная запись с этим адресом не найдена
zh: 未找到该邮箱的账户

# login_wrong_password
source: Incorrect password
ja: パスワードが間違っています
ru: Неверный пароль
zh: 密码错误

# login_error
source: An error has occurred
ja: エラーが発生しました
ru: Произошла ошибка
zh: 发生错误

# register_title
source: Hello, sign up to get started
ja: こんにちは、登録して始めましょう
ru: Здравствуйте, зарегистрируйтесь, чтобы начать
zh: 你好，注册并开始吧

# register_email_input_hint
source: Email
ja: メールアドレス
ru: Электронная почта
zh: 邮箱地址

# register_email_input_hint_focus
source: Enter your email
ja: メールアドレスを入力してください
ru: Введите вашу электронную почту
zh: 请输入邮箱地址

# register_user_input_hint
source: Username
ja: ユーザー名
ru: Имя пользователя
zh: 用户名

# register_user_input_hint_focus
source: Enter your username
ja: ユーザー名を入力してください
ru: Введите имя пользователя
zh: 请输入用户名

# register_password_input_hint
source: Password
ja: パスワード
ru: Пароль
zh: 密码

# register_password_input_hint_focus
source: Enter your password
ja: パスワードを入力してください
ru: Введите пароль
zh: 请输入密码

# register_re_password_input_hint
source: Re-enter Password
ja: パスワードを再入力
ru: Повторите пароль
zh: 再次输入密码

# register_re_password_input_hint_focus
source: Re-enter your password
ja: もう一度パスワードを入力してください
ru: Повторно введите пароль
zh: 请再次输入密码

# register_btn
source: Sign Up
ja: 新規登録
ru: Регистрация
zh: 注册

# register_question_login
source: Already have an account?
ja: すでにアカウントをお持ちですか？
ru: Уже есть аккаунт?
zh: 已有账户？

# register_btn_login
source: Login
ja: ログイン
ru: Войти
zh: 登录

# register_email_already_in_use
source: This email is already registered
ja: このメールはすでに登録されています
ru: Этот адрес электронной почты уже зарегистрирован
zh: 该邮箱已被注册

# register_invalid_email
source: Invalid email address
ja: 無効なメールアドレスです
ru: Неверный адрес электронной почты
zh: 无效邮箱地址

# register_operation_not_allowed
source: Email/password sign-in is not enabled
ja: メール/パスワードでのサインインは有効ではありません
ru: Вход по email/паролю не разрешен
zh: 邮箱/密码登录未启用

# register_weak_password
source: Password is too weak
ja: パスワードが弱すぎます
ru: Слишком слабый пароль
zh: 密码太弱

# register_error
source: An error has occurred
ja: エラーが発生しました
ru: Произошла ошибка
zh: 发生错误

# register_success
source: Account created successfully, return to login page
ja: アカウントが作成されました。ログインページに戻ってください
ru: Аккаунт успешно создан, вернитесь на страницу входа
zh: 账户已创建，请返回登录页面
